#+INCLUDE: "~/org/uni/org/config.org"
#+FILETAGS: :university:


** [2022-09-06 Tue] Clase 5
- [2022-09-06 Tue 16:03]


- "Vale más un peso hoy día que después."
- Compensasiones por consumo diferido.
  - Sacrifico hoy, con condición de una
    bonificación futura.
- Introducción a las Matemáticas Financieras.
  - Las salidas se anotan entre paréntesis.


- El mes comercial tiene 30 días.
- El año comercial tiene 360 dias.


- Concepto: tasa de interés es el precio unitario
  por utilizar el dinero en un lapso.
  - El interés se mide en porcentaje por
    unidad de tiempo.

- Los bancos son intermediarios financieros.
  - Al igual que un corredor de propiedades.
  - Uno de los más regulados pues
    un error en este rubro tiene un efecto
    multiplicador muy grande.
  - Un error por parte del banco implica
    una pérdida para sus clientes, no el banco.


#+begin_src R :session :results output
vi<-500000
interes<-0.0085
periodos<-48
vf_simple<-vi*((1+interes*periodos))
vf_compuesto<-vi*((1+interes)^periodos)
####
print("Inicial")
vi
print("Tasa de interes")
interes
print("Periodos")
periodos
print("Pago en Simple")
vf_simple
print("Interes simple")
vf_simple-vi
print("Total")
sum(vf_simple-vi)
print("Pago en Compuesto")
round(vf_compuesto)
print("Interes compuesto")
round(vf_compuesto)-vi
print("Total")
sum(round(vf_compuesto)-vi)
#+end_src

#+RESULTS:
#+begin_example
[1] "Inicial"
[1] 5e+05
[1] "Tasa de interes"
[1] 0.0085
[1] "Periodos"
[1] 48
[1] "Pago en Simple"
[1] 704000
[1] "Interes simple"
[1] 204000
[1] "Total"
[1] 204000
[1] "Pago en Compuesto"
[1] 750608
[1] "Interes compuesto"
[1] 250608
[1] "Total"
[1] 250608
#+end_example

- Concepto de media geométrica.


#+begin_src R :session :results output
## m<-mean(c(1,1.02,1.04))
## m
## x<-c(1,1.02,1.04)
## x<-c(14.1,14.1,14.1)
## exp(mean(log(x)))
## (1+0.0608)^2
## (14.1^(1/12))-1
#+end_src

#+RESULTS:
: [1] 0.2467181


- (1+Mo)^periodos=total
- (1+Mo)=(total^(1/periodos))
- Mo)=(total^(1/periodos))-1


- Riqueza máxima:
  - Lo máximo que puedo consumir hoy si no
    consumo nada mañana.
- Riqueza presente = sueldo hoy + deuda.
- W0=Y0 + (Y1/(1+r))


- Riqueza futura:
  - Lo máximo que puedo consumir mañana
    con tal de no consumir nada hoy.
- Riqueza futura = sueldo futuro + deuda.
- W1=Y1 + (Y0*(1+r))


- Proxima clase.
- Restricción presupuestal inter-temporal.

** [2022-09-08 Thu] Clase 6

- Seguridad.
- Salud.
- Educación.
- Pensiones.


- Ejemplo
\begin{align*}
  x + 0.03x = 10^6  \\
  x (1+0.03) = 10^6  \\
  x 1.03 = 10^6
\end{align*}

#+begin_src R :session :results output
10^6/(1.03)
#+end_src

#+RESULTS:
: [1] 970873.8

**** Ejercicio

#+begin_src R :session :results output
vi<-100000
interes<-0.02
periodos<-0:3
vf_simple<-vi*((1+interes*periodos))
vf_compuesto<-vi*((1+interes)^periodos)
####
print("Interes Simple")
vf_simple
print("Interes Compuesto")
round(vf_compuesto)
#+end_src

#+RESULTS:
: [1] "Interes Simple"
: [1] 100000 102000 104000 106000
: [1] "Interes Compuesto"
: [1] 100000 102000 104040 106121

